// Задача 60. ...
// Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. 
// Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.

// Запрашиваем данные,назначаем переменные,парсим

Console.WriteLine("Введите значение по x : ");
int x = int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите значение по y : ");
int y= int.Parse(Console.ReadLine()!);
Console.WriteLine("Введите значение по z : ");
int z = int.Parse(Console.ReadLine()!);

// Создаем массив,выполняем условия

int[,,] array3D = new int[x, y, z];
CreateArray(array3D);
PrintNumber(array3D);
void CreateArray(int[,,] array3D)
{
  int[] temp = new int[array3D.GetLength(0) * array3D.GetLength(1) * array3D.GetLength(2)];
  int  number;
  for (int i = 0; i < temp.GetLength(0); i++)
  {
    temp[i] = new Random().Next(10, 20);
    number = temp[i];
    if (i >= 1)
    {
      for (int j = 0; j < i; j++)
      {
        while (temp[i] == temp[j])
        {
          temp[i] = new Random().Next(10, 20);
          j = 0;
          number = temp[i];
        }
          number = temp[i];
      }
    }
  }
  int count = 0; 
  for (int x = 0; x < array3D.GetLength(0); x++)
  {
    for (int y = 0; y < array3D.GetLength(1); y++)
    {
      for (int z = 0; z < array3D.GetLength(2); z++)
      {
        array3D[x, y, z] = temp[count];
        count++;
      }
    }
  }
}
// Выводим результат
void PrintNumber(int[,,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            for (int k = 0; k < array.GetLength(2); k++)
            {
                Console.Write($"{array[i,j,k]} ({i},{j},{k})");
            }
        }
        Console.WriteLine();
    }

}
 
