// Задача №2
// Напишите программу, которая на вход принимает два числа и выдаёт, 
// какое число большее, а какое меньшее.

// Запрашиваем числа

Console.WriteLine("Введите A число: ");

Console.WriteLine("Введите B число: ");

// Преобразуем числа

int numA = Convert.ToInt32(Console.ReadLine());
int numB = Convert.ToInt32(Console.ReadLine());

// Выполняем условие
    if (numA > numB)

// Выводим ответ если условие верно

Console.WriteLine("Число А больше числа В");

    else 

// Выводим ответ если условие неверно

Console.WriteLine("Число B больше числа A");

    
        
    
